---
kind: method
id: M:Autodesk.Revit.DB.ForgeTypeId.#ctor
source: html/1f599313-4f0a-2fd3-8644-616a9619a656.htm
---
# Autodesk.Revit.DB.ForgeTypeId.#ctor Method

Constructs a ForgeTypeId holding an empty schema identifier.

## Syntax (C#)
```csharp
public ForgeTypeId()
```